In [1]:
#Data cleaning to deal with missing numerical data

In [2]:
#import the required libraries

import pandas as pd
import numpy as np

In [4]:
#creating a pandas series with null values

data = pd.Series([1, np.nan, 'hello', None])

data

#np.Nan and None are the null values

0        1
1      NaN
2    hello
3     None
dtype: object

In [6]:
#I want to extract all values which are null
data[data.isnull()]

1     NaN
3    None
dtype: object

In [9]:
#I want to extract all values which are not null
data[data.notnull()]

0        1
2    hello
dtype: object

In [10]:
#I want to drop all the rows with null values

data = data.dropna()
data

0        1
2    hello
dtype: object

In [11]:
a=5
a+6

11

In [12]:
a=5
a=a+6
a

11

In [13]:
#Define a new series

newData = pd.Series([np.nan, np.nan, 2, None, 3])

newData

0    NaN
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [14]:
#Method-1: Fill null values with 0
newData.fillna(0)

0    0.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

In [18]:
#Method-2: Forward Filling
newData.fillna(method='ffill')

0    NaN
1    NaN
2    2.0
3    2.0
4    3.0
dtype: float64

In [19]:
#Method-3: Backward Filling
newData.fillna(method='bfill')

0    2.0
1    2.0
2    2.0
3    3.0
4    3.0
dtype: float64

In [28]:
newData.fillna(newData.mean())

0    2.5
1    2.5
2    2.0
3    2.5
4    3.0
dtype: float64

In [29]:
#Let's define a dataframe with null values

df = pd.DataFrame([[1,np.nan, 2],
                  [2,3,5],
                  [np.nan, 4, 6]])

df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [30]:
#Drop row with null values

df.dropna()

     0    1  2
1  2.0  3.0  5

In [33]:
#Drop columns with null values

df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [34]:
## 0 is row
## 1 is column

In [35]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [37]:
df.fillna(method='ffill',axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [38]:
#Try to do a ffill of the df at both row and cols levels

In [41]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [44]:
df.fillna(method='ffill',axis='columns')

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [45]:
df.fillna(method='ffill',axis='rows')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6